import Section from "@/templates/Section";
import Title from "@/templates/Title";
import { Box, Container, Typography } from "@mui/material";
import React from "react";

const Policy = () => {
  const paragraphs = [
    {
      id: 1,
      title: "",
      description:
        "خصوصيتك مهمة لـ Vision Things. عندما تستخدم خدماتنا، فإنك تثق بنا فيما يتعلق بمعلوماتك. نحن ندرك أن هذه مسؤولية كبيرة ونعمل جاهدين لحماية معلوماتك وإبقائك متحكمًا.",
    },
    {
      id: 2,
      title: "",
      description:
        "يشرح إشعار الخصوصية هذا ماهية البيانات الشخصية التي تعالجها Vision Things، وكيفية معالجة Vision Things لها، ولأي أغراض. تمت صياغته وفقًا لنظام ولوائح حماية البيانات الشخصية في المملكة العربية السعودية لمساعدتك على فهم طبيعة البيانات التي نجمعها منك وكيف سيتم التعامل مع هذه البيانات بواسطة Vision Things لأغراض إشعار الخصوصية هذا، البيانات الشخصية يعني أي عنصر من البيانات، بغض النظر عن مصدرها أو شكلها على الإطلاق، والتي قد تؤدي بشكل مستقل أو عند دمجها مع معلومات أخرى متاحة إلى تحديد هوية شخص بما في ذلك على سبيل المثال لا الحصر: الاسم الأول واللقب، ورقم الهوية الوطنية السعودية، والعناوين، والهاتف. الرقم أو رقم الحساب البنكي أو رقم بطاقة الائتمان أو البيانات الصحية أو الصور أو مقاطع الفيديو الخاصة بالشخص.",
    },
    {
      id: 3,
      title: "",
      description:
        "ينطبق إشعار الخصوصية هذا على جميع قطاعات ووحدات الأعمال في الشركة. جميع موظفي الشركة والمقاولين والبائعين الذين يعملون إما على أساس دائم أو مؤقت ملزمون باتباع المعايير المحددة.",
    },
    {
      id: 4,
      title: "لماذا نقوم بجمع واستخدام بياناتك الشخصية؟",
      description:
        "لتزويدك بأعلى مستوى من الخدمة والمنتجات، نقوم بجمع بياناتك الشخصية واستخدامها. الأساس القانوني لمعالجة بياناتك الشخصية هو:",
      list: [
        "تعاقدي - للوفاء بالتزامات الخدمة تجاهك.",
        "الموافقة - للأنشطة الأخرى مثل المعلومات والمبيعات والتسويق.",
        "الامتثال القانوني - الامتثال للمتطلبات الحكومية بما في ذلك، على سبيل المثال لا الحصر، الأمن القومي وحماية الصحة العامة.",
      ],
    },
    {
      id: 5,
      title: "تتضمن أغراض جمع البيانات هذه، على سبيل المثال لا الحصر، ما يلي:",
      description: "",
      list: [
        "تمكين ودعم عملياتنا وأنظمتنا لضمان استمرارية وجودة خدماتنا، وتوفير فواتير دقيقة وتمكيننا من معالجة المدفوعات للمنتجات والخدمات.",
        "فهم احتياجاتك كعملاء وأهليتك للمنتجات والخدمات والتوصية بالمنتجات والخدمات التي قد تكون ذات صلة بك",
        "قم بحل أي استفسارات أو شكاوى قد تكون لديك واسمح لنا بتزويدك بتجربة عملاء مخصصة عبر جميع قنواتنا.",
        "تقديم تقارير إلى أطراف ثالثة و/أو عملاء مؤسستنا حيث لا تحتوي هذه التقارير على أي معلومات شخصية عنك أو أي معلومات قد تحدد هويتك كشخص وفقًا للوائح الخصوصية المحلية.",
        ,
        "بالإضافة إلى ذلك، قد تعمل Stuff Vision مع كيانات أخرى لضمان جودة الخدمة المقدمة. إذا تم الكشف عن بياناتك الشخصية لهذه الكيانات، فسيقتصر ذلك على الأغراض المحددة في إشعار الخصوصية هذا والتي قدمت موافقتك عليها.",
      ],
      anotherDiscription:
        "شكرًا لك على استخدام موقع See Things. نحن ملتزمون بحماية خصوصيتك ونحترم حقك في التحكم في بياناتك الشخصية.",
    },
    {
      id: 6,
      title: "ما هي البيانات التي نجمعها؟",
      description:
        "نقوم بجمع المعلومات التي تقدمها لنا، مثل اسمك وعنوان بريدك الإلكتروني ورقم هاتفك وعنوانك وتاريخ ميلادك. نقوم أيضًا بجمع المعلومات الناتجة عن استخدامك لموقعنا الإلكتروني، مثل عنوان IP الخاص بك، ونوع المتصفح الذي تستخدمه، وصفحات الويب التي تزورها.",
      list: [],
    },
    {
      id: 7,
      title: "كيف نستخدم البيانات التي نجمعها؟",
      description:
        "نحن نستخدم البيانات التي نجمعها لتقديم الخدمات التي تطلبها منا، مثل إرسال البريد الإلكتروني والرد على استفساراتك. نستخدم أيضًا البيانات التي نجمعها لتحسين موقعنا وخدماتنا ولتزويدك بتجربة أفضل.",
    },
    {
      id: 8,
      title: "كيف نحمي بياناتك الشخصية؟",
      description:
        "نحن نستخدم مجموعة متنوعة من التدابير الأمنية للحماية من الوصول غير المصرح به إلى بياناتك الشخصية، بما في ذلك تقنيات التشفير وجدار الحماية. كيف يمكنك الوصول إلى بياناتك الشخصية وتصحيحها؟ لديك الحق في الوصول إلى بياناتك الشخصية وتصحيحها. يمكنك القيام بذلك عن طريق الاتصال بنا على info@vision-things.com.",
    },
    {
      id: 9,
      title: "كيف يمكنك إلغاء الاشتراك في تلقي التسويق عبر البريد الإلكتروني؟",
      description:
        "يمكنك إلغاء الاشتراك في تلقي التسويق عبر البريد الإلكتروني من خلال النقر على رابط إلغاء الاشتراك الموجود في أي بريد إلكتروني نرسله إليك.",
    },
    {
      id: 10,
      title: "كيف يمكنك الاتصال بنا؟",
      description:
        "إذا كانت لديك أية أسئلة أو استفسارات بشأن سياسة الخصوصية الخاصة بنا، فلا تتردد في الاتصال بنا على info@vision-things.com.",
      list: [],
    },
    {
      id: 11,
      title: "تعديلات على سياسة الخصوصية",
      description:
        "يجوز لنا تعديل سياسة الخصوصية الخاصة بنا من وقت لآخر. إذا أجرينا أي تغييرات مهمة، فسنخطرك عن طريق نشر إشعار على موقعنا.",
      list: [],
    },
    {
      id: 12,
      title: "",
      description: "جميع الحقوق محفوظة",
      list: [],
    },
  ];
  return (
    <Section>
      <Container>
        <Box py={5} sx={{ direction: "rtl" }}>
          <Box display={"flex"} justifyContent={"center"} mb={5}>
            <Title>
              <Typography textAlign={"center"} variant="h3" color={"white"}>
                سياسة الخصوصية
              </Typography>
            </Title>
          </Box>
          {paragraphs.map((p) => (
            <Box key={p.id} mb={2}>
              <Typography variant="h5" color={"white"}>
                {p.title}
              </Typography>
              <Typography>{p.description}</Typography>
              <ul>
                {p.list?.map((e, index) => (
                  <li key={index}>
                    <Typography>{e}</Typography>
                  </li>
                ))}
              </ul>
              <Typography>{p?.anotherDiscription}</Typography>
            </Box>
          ))}
        </Box>
      </Container>
    </Section>
  );
};

export default Policy;
