import Section from "@/templates/Section";
import Title from "@/templates/Title";
import { Box, Container, Typography } from "@mui/material";
import React from "react";

const TermsAndConditions = () => {
  const paragraphs = [
    {
      id: 1,
      title: "",
      description:
        "يُشار إلى هذه الشروط والأحكام بموجب هذه الشروط والأحكام على أنها الشروط التي تمليها لتنظيم استخدام Vision-Things بواسطة الموقع الإلكتروني الرئيسي لـ Vision-Things أو أي جزء منه، بما في ذلك المواقع الفرعية أو المواقع المرجعية للعقارات المشار إليها هنا باسم Vision-Things بواسطة تحتفظ الشركة بالحق في تعديل هذه الشروط من جانب واحد أو عند التغيير في السياق التنظيمي أو القضائي أو التشريعي أو الإقليمي. أنت بموجب هذا، كمستخدمين، تشير إلى موافقتك على هذه الشروط، وبالتالي فإنك ملتزم بهذه الشروط. إذا كنت لا توافق على شروط الاستخدام هذه، فيرجى عدم استخدام هذا الموقع أو أي تطبيقات الهاتف المحمول التابعة له.",
    },
    {
      id: 2,
      title: "",
      description:
        'شكرًا لك على استخدام موقع Vision Things. من خلال الوصول إلى موقع VISION THINGS أو استخدامه، فإنك توافق على الالتزام بهذه الشروط والأحكام ("الشروط"). إذا لم توافق على هذه الشروط، فلا يُسمح لك باستخدام موقع SEE THINGS. يرجى ملاحظة أن هذه الشروط قد تتغير من وقت لآخر. سيتم نشر أي تغييرات على هذه الصفحة، وستكون سارية فور نشرها. يرجى مراجعة هذه الصفحة بانتظام للحصول على أحدث التغييرات.',
    },
    {
      id: 3,
      title: "شروط الاستخدام المقبولة:",
      description: "",
      list: [
        "لا يتعرض موقع Vision-things لأي خرق غير قانوني أو تشويه أو تلاعب أو إغراق في حركة المرور أو التحميل الزائد من أي نوع، في حالة ملاحظة خلل أو أي نوع من عدم الدقة. يجب إخطار أشياء الرؤية على الفور عن طريق أشياء الرؤية.",
        "يوافق المستخدمون على عدم نشر أي أدوات تم إنشاؤها من خلال رؤية الأشياء على مواقع الويب، أو من خلال التعداد أو التعدين أو التجميع أو تحليل البيانات من أي نوع، حيث لم يتم تصميمها أو القصد من الكشف عنها.",
        "يجب على Vision-things بذل العناية الواجبة ولن تكون مسؤولة عن أي خرق للشروط بما يتجاوز الظروف المعقولة، وإلا يجوز للمحكمة توجيه اتهامات ضدها.",
        "لا يجوز للمستخدمين استخدام مواقع رؤية الأشياء كمنصة لنشر البريد العشوائي أو التصرف بأي شكل من الأشكال يعتبر غير لائق أخلاقياً، بما في ذلك (العمر، الجنس، اللون، الدين، العرق، النسب، الجنسية، الإعاقة، والحالة الاجتماعية). قانون مكافحة الجريمة.",
        "قد يتم في بعض الأحيان تعليق أو تقييد الوصول إلى الأشياء المرئية بواسطة مواقع الويب لأسباب تشغيلية مثل الصيانة أو تقديم مرافق أو منتجات جديدة.",
        "تحتفظ Vision-things بالحق في تعديل أو تعديل أو حذف أو تعليق أو إيقاف، بشكل مؤقت أو دائم، في أي وقت ودون إشعار مسبق، أي محتوى، بما في ذلك أي منتجات متاحة من خلال موقع Vision-things.",
        "يجوز لشركة Vision-things، وفقًا لتقديرها الخاص، إلغاء أو إنهاء أو تعليق الوصول إلى موقع Vision-things أو التسجيل فيه عن طريق المواقع عند انتهاك واضح للشروط، دون إشعار المستخدمين.",
        "قد يخضع أي محتوى مكتوب أو تم تحميله على مواقع الويب للتدقيق وقد يتم حذفه إذا وجد أنه ضار دون أي إشعار آخر للمستخدمين.",
      ],
    },
    {
      id: 4,
      title: "من أجل المحتوى وحقوق النشر",
      description: "",
      list: [
        "المحتوى المقدم من Vision-things من خلال تضمين المعلومات والبيانات والمواد والنصوص والتصميمات والرسومات والصور ومقاطع الفيديو والصور والتطبيقات والبرامج والصوت والملفات الأخرى، المحددة والمعروضة، مملوك لشركة Vision-things أو مرخص له -الأشياء من خلال أطراف ثالثة. إنه محمي بموجب حقوق الطبع والنشر والعلامة التجارية وحقوق الملكية الفكرية الأخرى حسب الاقتضاء ويتم توفيره لاستخدامك الخاص فقط. يُحظر إعادة نشر المحتوى أو إعادة توزيعه، بما في ذلك عن طريق التأطير أو وسائل مماثلة.",
        "يقبل المستخدمون المسؤولية المطلقة عن كافة المحتويات بما في ذلك التعليقات والملفات والمواد والاقتراحات والأفكار التي يتم تحميلها أو نشرها على مواقع رؤية الأشياء بواسطة المواقع أو نقلها إلى مستخدمين آخرين من خلال مواقع رؤية الأشياء عن طريق المواقع.",
      ],
    },
    {
      id: 5,
      title: "التعويض",
      description: "",
      list: [
        "يجب على المستخدمين تعويض رؤية الأشياء من قبل أو أي مستخدم يتأثر بخرق الشروط كمسؤولية ثابتة وفقًا لأحكام المحكمة.",
      ],
    },
    {
      id: 6,
      title: "القانون الواجب التطبيق",
      description: "",
      list: [
        "تخضع هذه الشروط لقوانين المملكة العربية السعودية وتخضع لقوانين الجرائم الإلكترونية الدولية. يجب تقديم أي نزاعات تنشأ عن استخدام الأشياء المرئية إلى السلطة القضائية الحصرية للمحاكم السعودية. تحتفظ شركة Vision-things بالحق في رفع دعوى أمام محاكم البلد الذي تقيم فيه.",
        "يعمل كل شرط من هذه الشروط بشكل منفصل. إذا قررت أي محكمة أو سلطة مختصة أن أيًا منها غير قانوني أو غير قابل للتنفيذ، فستظل الأحكام المتبقية سارية المفعول والتأثير الكامل.",
      ],
    },
    {
      id: 7,
      title: "الاستخدام المقبول",
      description:
        "يجوز لك استخدام Vision Things للأغراض القانونية فقط. يُحظر عليك استخدام See Things لأي غرض غير قانوني أو غير مصرح به، بما في ذلك، على سبيل المثال لا الحصر: نشر أو توزيع أي مواد مسيئة أو غير قانونية أو مسيئة أو تشهيرية أو تمييزية أو تهديدية أو إباحية أو غير لائقة. نشر أو توزيع أي مادة تنتهك حقوق أي طرف ثالث، بما في ذلك حقوق الطبع والنشر والعلامات التجارية والسرية وحقوق الملكية. تحميل أو توزيع أي فيروسات أو برامج ضارة أو برامج أخرى قد تضر بالموقع أو بمعدات المستخدمين الآخرين. إجراء أي أنشطة قد تؤدي إلى إتلاف أو تعطيل أو التأثير سلبًا على رؤية الأشياء أو الأجهزة الخاصة بالمستخدمين الآخرين.",
    },
    {
      id: 8,
      title: "حقوق الملكية الفكرية",
      description:
        "جميع المحتويات الموجودة على موقع Object Vision، بما في ذلك، على سبيل المثال لا الحصر، النصوص والصور والرسومات والعلامات التجارية والشعارات، هي ملكية حصرية لشركة Object Vision أو مورديها. أنت توافق على عدم نسخ أو توزيع أو إعادة إنتاج أو عرض أو نشر أو نقل أو تعديل أو إنشاء أعمال مشتقة من أي من هذه المواد بأي شكل من الأشكال أو بأي وسيلة، دون الحصول على إذن كتابي مسبق من See Things.",
    },
    {
      id: 9,
      title: "الروابط",
      description:
        "يمكنك إنشاء رابط إلى الصفحة الرئيسية لموقع See Things، بشرط أن تفعل ذلك بطريقة عادلة وقانونية ولا تضر بسمعة Things See أو منتجاتها أو خدماتها. لا يُسمح لك بإنشاء رابط لأي صفحة أخرى من موقع See Things دون الحصول على إذن كتابي مسبق من See Things.",
    },
    {
      id: 10,
      title: "الضمانات",
      description:
        'يتم توفير موقع SEE THINGS على الويب "كما هو" و"كما هو متاح". لا تقدم See-Things أي ضمانات، صريحة أو ضمنية، فيما يتعلق بـ See-Things أو المواد الموجودة على See-Things، بما في ذلك، على سبيل المثال لا الحصر، الضمانات الضمنية الخاصة بقابلية التسويق والملاءمة لغرض معين وعدم الانتهاك.',
    },
    {
      id: 11,
      title: "تحديد المسؤولية",
      description:
        "لن تتحمل شركة Object Vision أو مورديها بأي حال من الأحوال المسؤولية عن أي أضرار مباشرة أو غير مباشرة أو عرضية أو تبعية أو خاصة أو تأديبية، بما في ذلك، على سبيل المثال لا الحصر، خسارة الأرباح أو الإيرادات أو البيانات أو الاستخدام، الناشئة عن أو فيما يتعلق بـ كيفية استخدام موقع الهدف، حتى لو تم إخطار موقع الهدف باحتمال حدوث مثل هذه الأضرار. قد يؤدي إنهاء Vision Things إلى إنهاء حقك في استخدام See Things في أي وقت ولأي سبب، بما في ذلك، على سبيل المثال لا الحصر، انتهاكك لهذه الشروط. عند إنهاء حقك في استخدام موقع See Things، سيتم إنهاء حسابك وجميع البيانات والمعلومات المرتبطة به وحذفها من قاعدة بيانات See Things.",
    },
    {
      id: 12,
      title: "القانون الواجب التطبيق",
      description:
        "تخضع هذه الشروط وتفسر وفقًا لقوانين المملكة العربية السعودية، بغض النظر عن قواعد تنازع القوانين. أنت توافق على الخضوع للاختصاص القضائي الحصري للمحاكم الموجودة في المملكة العربية السعودية.",
    },
    {
      id: 13,
      title: "",
      description: "جميع الحقوق محفوظة",
    },
  ];
  return (
    <Section>
      <Container>
        <Box py={5} sx={{ direction: "rtl" }}>
          <Box display={"flex"} justifyContent={"center"} mb={5}>
            <Title>
              <Typography textAlign={"center"} variant="h3" color={"white"}>
                الأحكام والشروط
              </Typography>
            </Title>
          </Box>
          {paragraphs.map((p) => (
            <Box key={p.id}>
              <Typography variant="h5" color={"white"}>
                {p.title}
              </Typography>
              <Typography>{p.description}</Typography>
              <ul>
                {p.list?.map((e, index) => (
                  <li key={index}>
                    <Typography>{e}</Typography>
                  </li>
                ))}
              </ul>
            </Box>
          ))}
        </Box>
      </Container>
    </Section>
  );
};

export default TermsAndConditions;
